namespace MysteryRiddles.Data
{
    using System.Collections.Generic;

    using System.Data.Entity.Migrations;
    using MysteryRiddles.Models;

    public class DataSeeder
    {
        public void SeedRiddles(MysteryRiddlesDbContext context)
        {
            var riddles = new List<Riddle>
            {
                new Riddle()
                {
                    Title = "Мистър Браун в Лондон",
                    Description = @"В полунощ, в Лондон, в един влак, по коридора минава един човек.
Влиза в едно купе.
От купето се чува писък.
Влизат хора и виждат мъртва жена.
идва полиция. Разследват и хващат Мистър Браун.
Завеждат го в участъка и го разпитват.
Той им казва, че се казва Мистър Браун и... и го пускат.
Защо?",
                    Answer = "Жената е съпругата на мистър Браун, която преди години е инсценирала смъртта си и е набедила съпруга си. Той излежал присъдата си. След като я среща във влака я убива. Уловката е там, че не можеш да лежиш два пъти за едно престъпление."
                },
                new Riddle()
                {
                    Title = "Близнаци",
                    Description = "Митко и Данчо са близнаци, родени в Бургас през 1985г. Митко е бил роден преди Данчо, но според актовете им за раждане Данчо е по-стар от Митко, как така?",
                    Answer = "Митко и Данчо са зодия близнаци."
                },
                new Riddle()
                {
                    Title = "Осмият Етаж",
                    Description = @"Един човек живее на 8-ия етаж. Когато вали, се качва с асансьора до 8-мия етаж, иначе - до 5-тия и след това на горе пеш. 
Защо?",
                    Answer = "Човекът е нисък и не достига до копчето на 8-мия етаж, но когато вали носи чадър и с негова помощ успява да го натисне."
                },
                new Riddle()
                {
                    Title = "Адам и Ева",
                    Description = @"Ходят си двама археолози през пустинята и попадат в една пещера. В тази пещера намират 2 голи трупа на мъж и жена, легнали по гръб. Поради специфични условия в пещерата и двете тела били перфектно запазени - с плътта, с всичко. 
Единият учен казал:
- Това са Адам и Ева.
Другият веднага се съгласил с него. 
Как са разбрали двамата учени, че това са именно Адам и Ева?",
                    Answer = "Нямали са пъпове."
                },
                new Riddle()
                {
                    Title = "Мъртъв Гол Мъж",
                    Description = @"В пустинята намерили мъртъв гол мъж, около него дрехи, храна... В ръката си държал пръчка.
Какво се е случило?",
                    Answer = "Летял е с балон с други хора, но балонът е тръгнал да пада. Изхвърлили са всички излишни неща от него, включително храната и дрехите си, но когато вече нямало какво да изхвърлят - един от тях трябвало да скочи и той изтеглил късата клечка."
                },
                new Riddle()
                {
                    Title = "Влакът Мина",
                    Description = @"Влакът мина и тя умря.
Какво се е случило?",
                    Answer = "Коза, завързана за бариерата. Когато се е вдигнала, козата се е обесила."
                },
                new Riddle()
                {
                    Title = "Каубой в Пустинята",
                    Description = @"Един каубой препуска през пустинята. Стига до един бар, влиза вътре, поръчва си чаша вода, чува изстрел и излиза.
Какво се е случило?",
                    Answer = "Хълцал е. Поръчал си е вода, за да пие и да се оправи, но като чул изстрел се стреснал и вече не е имал нужда от водата."
                },
                new Riddle()
                {
                    Title = "Конно Състезание",
                    Description = @"На един празник в село било уредено състезание. Щели да се надбягват с конете си двама момци от селото. Наградата за победителя била голяма. Само че условията за надбягването били малко чудновати: наградата щял да получи този, чийто кон стигне последен до целта.
Качили се момците на конете си, развикали се хората, но.. никой не мърда. Всеки чака другия да тръгне пръв, за да стигне той последен и да вземе наградата.
Минало доста време. Викали хората, викали, па взели да се разотиват.
В това време от селото излязъл старец. Попитал каква е работата, помислил малко, па рекъл на хората:
-Върнете се, ще се нареди.
Доближил старецът до момците, които още стърчали на конете си, и ги помолил да слязат, за да им каже нещо на ухото.
Слезли момците и старецът им прошепнал две-три думи.
Момците веднага скочили на конете и ги препуснали с все сила.
Какво им е прошепнал старецът?",
                    Answer = "Да си сменят конете. Печели последният кон, не последният играч."
                },
                new Riddle()
                {
                    Title = "Разбитият Самолет",
                    Description = @"Един шейх бил толкова богат, че вече се чудел какво да прави с парите си и решил, че единствено на самолет не се е качвал. На другата сутрин решил да се отправи към летището и да осъществи и тази си прищявка, но на входа нощният пазач му казал, че през нощта е сънувал много лош сън – как самолетът се разбива и господарят му загива. Уплашил се шейхът от тези думи, тъй като бил доста суеверен и не се качил на самолета. Вечерта наистина съобщили, че точно този самолет, (с който щял да лети владетелят) се е разбил. Благодарил шейхът на пазача, но след това го уволнил. Защо?"
                    Answer = "Защото спи на работното си място."
                },
                new Riddle()
                {
                    Title = "Любителят на числото 3",
                    Description = @"Собственикът на един бар бил любител на числото 3 и кръглите форми: кръгли маси с по три крака, кръгъл барплот, трикрили гардероби, три сервитьорки на три смени и т.н. 
Станало убийство. Убит е барманът. Инспекторът разпитва клиентите какво са правили по време на изстрела. 
Маса 1: Иванов и Петров разговаряли за бизнес дела и пиели уиски.
Маса 2: Сервитьорката поднасяла коктейли на Петрова и Иванова, а те обсъждали новите модни тенденции.
Маса 3: Масата се клатела и Тодоров я подпирал с капачка от бира.
Останалите маси, кратни на числото 3, били свободни.
Кой и защо е убиецът?",
                    Answer = "Тодоров е убиецът, защото е излъгал инспектора - трикраките маси НЕ се клатят и той няма за какво да я подпира с капачката."
                },
                new Riddle()
                {
                    Title = "Папагал",
                    Description = @"Отива един човек да си купи говорещ папагал. Продавачът в магазина му посочил един, за който казал, че повтаря всичко това което чуе. Решил човекът да опита дали наистина е така, но папагалът не казал нищо.
Как е възможно това?",
                    Answer = "Папагалът е бил глух."
                },
                new Riddle()
                {
                    Title = "Купува се!",
                    Description = @"Купува се!
Който го купи - не го ползва!
Който го ползва - не го вижда!
Какво е?",
                    Answer = "Ковчег."
                },
                new Riddle()
                {
                    Title = "Пилот на Самолет",
                    Description = @"Представете си, че сте пилот в един самолет. На едното летище във вече пълния самолет се качват терористи, хващат ви и ви завързват в един ъгъл, един сяда на вашето място и нарочно подкарва самолета към една пропаст. След малко ще се разбиете и никой няма да оцелее. 
Какво да направите, за да се спасите?"
                    Answer = "Ще спра да си представям."
                },
                new Riddle()
                {
                    Title = "Ромео и Жулиета",
                    Description = @"Ромео се прибира пиян вкъщи. Ляга си и заспива. През нощта се буди от жажда и в просъница напипва съд, изпива течността и пак заспива. Когато се събудил на следващия ден видял Жулиета мъртва.
Какво е станало?",
                    Answer = "Жулиета е била рибка. Той е изпил водата от аквариума."
                },
                new Riddle()
                {
                    Title = "Ромео и Жулиета",
                    Description = @"Един моторист кара в някакво село по тесен път. Фаровете му не работят, няма и лампи по улицата, както и лунна светлина. На средата на улицата вървял човек, облечен целия в черно, но мотористът успял да го избегне. 
Как?",
                    Answer = "Било е ден."
                },
                new Riddle()
                {
                    Title = "Супа от Чайки",
                    Description = @"Две жени сядат в рестоант. Едната отваря менюто и вижда супа от чайки. Разплаква се и избягва от масата.
Какво е станало?",
                    Answer = "Жените са майка и дъщеря. Имало е корабокрушение, при което двете, заедно с бащата на момичето са останали на безлюден остров. За да се изхранват се е наложило майката да убие бащата, от когото е правела супа, като е казвала на момичето, че е от чайки. Като ги спасяват момичето е разбрало."
                },
                new Riddle()
                {
                    Title = "Кръгла Стая",
                    Description = @"Един човек чел книга в една кръгла стая. В един момент станал загасил лампата и си легнал. На сутринта имало много умрели.",
                    Answer = "Човекът е живял във фар и загасил фара, при което много кораби са корабокруширали."
                }
            };

            context.Riddles.AddOrUpdate(riddles.ToArray());
            context.SaveChanges();
        }
    }
}
